src/test/java/jmeter/tests/store/reports/statistics.json
{
  "Load Test" : {
    "transaction" : "Load Test",
    "sampleCount" : 57248,
    "errorCount" : 15341,
    "errorPct" : 26.797443,
    "meanResTime" : 395.48017397987553,
    "medianResTime" : 389.0,
    "minResTime" : 128.0,
    "maxResTime" : 1806.0,
    "pct1ResTime" : 394.0,
    "pct2ResTime" : 396.0,
    "pct3ResTime" : 692.0,
    "throughput" : 95.36263220054671,
    "receivedKBytesPerSec" : 125.04204633026359,
    "sentKBytesPerSec" : 75.69304754534673
  },
  "Baseline Test" : {
    "transaction" : "Baseline Test",
    "sampleCount" : 10,
    "errorCount" : 3,
    "errorPct" : 30.0,
    "meanResTime" : 1137.7,
    "medianResTime" : 998.0,
    "minResTime" : 396.0,
    "maxResTime" : 2536.0,
    "pct1ResTime" : 2472.8,
    "pct2ResTime" : 2536.0,
    "pct3ResTime" : 2536.0,
    "throughput" : 3.225806451612903,
    "receivedKBytesPerSec" : 4.225365423387097,
    "sentKBytesPerSec" : 2.5611139112903225
  },
  "Get Order - GET" : {
    "transaction" : "Get Order - GET",
    "sampleCount" : 57237,
    "errorCount" : 15344,
    "errorPct" : 26.807835,
    "meanResTime" : 131.50963537571917,
    "medianResTime" : 130.0,
    "minResTime" : 127.0,
    "maxResTime" : 836.0,
    "pct1ResTime" : 131.0,
    "pct2ResTime" : 132.0,
    "pct3ResTime" : 138.0,
    "throughput" : 95.7042843455768,
    "receivedKBytesPerSec" : 41.134389340614916,
    "sentKBytesPerSec" : 21.122234630957376
  },
  "Get Inventory - GET" : {
    "transaction" : "Get Inventory - GET",
    "sampleCount" : 57224,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 131.61914581294502,
    "medianResTime" : 130.0,
    "minResTime" : 127.0,
    "maxResTime" : 750.0,
    "pct1ResTime" : 131.0,
    "pct2ResTime" : 132.0,
    "pct3ResTime" : 139.0,
    "throughput" : 95.71983915106017,
    "receivedKBytesPerSec" : 41.78398752703537,
    "sentKBytesPerSec" : 20.190903570926757
  },
  "Spike Test" : {
    "transaction" : "Spike Test",
    "sampleCount" : 2500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 405.6763999999989,
    "medianResTime" : 158.0,
    "minResTime" : 128.0,
    "maxResTime" : 5524.0,
    "pct1ResTime" : 1278.9,
    "pct2ResTime" : 1693.449999999998,
    "pct3ResTime" : 2217.9399999999987,
    "throughput" : 346.83684794672587,
    "receivedKBytesPerSec" : 154.45078385127636,
    "sentKBytesPerSec" : 125.66061580882352
  },
  "Create Order - POST" : {
    "transaction" : "Create Order - POST",
    "sampleCount" : 60058,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 146.12707715874595,
    "medianResTime" : 130.0,
    "minResTime" : 127.0,
    "maxResTime" : 5524.0,
    "pct1ResTime" : 131.0,
    "pct2ResTime" : 132.0,
    "pct3ResTime" : 141.0,
    "throughput" : 100.07131526679908,
    "receivedKBytesPerSec" : 44.56300757974646,
    "sentKBytesPerSec" : 36.25630660545161
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 174569,
    "errorCount" : 15346,
    "errorPct" : 8.790793,
    "meanResTime" : 136.6093063487806,
    "medianResTime" : 130.0,
    "minResTime" : 127.0,
    "maxResTime" : 5524.0,
    "pct1ResTime" : 131.0,
    "pct2ResTime" : 132.0,
    "pct3ResTime" : 138.0,
    "throughput" : 290.8746450899106,
    "receivedKBytesPerSec" : 127.2463287165168,
    "sentKBytesPerSec" : 77.46413877234433
  },
  "Stress Test" : {
    "transaction" : "Stress Test",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 563.5999999999999,
    "medianResTime" : 521.0,
    "minResTime" : 514.0,
    "maxResTime" : 3540.0,
    "pct1ResTime" : 529.0,
    "pct2ResTime" : 560.6499999999999,
    "pct3ResTime" : 1537.99,
    "throughput" : 1.001599220088074,
    "receivedKBytesPerSec" : 0.4460246526954704,
    "sentKBytesPerSec" : 0.36288409243425335
  }
}